# Concat Functionality of PANDAS

In [1]:
import pandas as pd

In [4]:
Pak_weather={
    "city":["Lahore","Karachi","Multan"],
    "temp":[35,40,39],
    "humidity":[60,70,59]
}
df1=pd.DataFrame(Pak_weather)
df1

      city  temp  humidity
0   Lahore    35        60
1  Karachi    40        70
2   Multan    39        59

In [7]:
USA_weather={
    "city":["New York","LA","Chicago"],
    "temp":[25,16,50],
    "humidity":[80,65,60]
}
df2=pd.DataFrame(USA_weather)
df2

       city  temp  humidity
0  New York    25        80
1        LA    16        65
2   Chicago    50        60

**Now we are going to concate these 2 DataFrames**

In [9]:
res_df=pd.concat([df1,df2])
res_df

       city  temp  humidity
0    Lahore    35        60
1   Karachi    40        70
2    Multan    39        59
0  New York    25        80
1        LA    16        65
2   Chicago    50        60

**Now the problem is the index**

In [10]:
res_df=pd.concat([df1,df2],ignore_index=True)
res_df

       city  temp  humidity
0    Lahore    35        60
1   Karachi    40        70
2    Multan    39        59
3  New York    25        80
4        LA    16        65
5   Chicago    50        60

**Now if what you want to retrieve back the data set of individual countries**

In [12]:
res_df=pd.concat([df1,df2],keys=["Pakistan","USA"])
res_df

                city  temp  humidity
Pakistan 0    Lahore    35        60
         1   Karachi    40        70
         2    Multan    39        59
USA      0  New York    25        80
         1        LA    16        65
         2   Chicago    50        60

**So , now you can use the list of location to retrieve back that info**

In [14]:
res_df.loc['Pakistan']

      city  temp  humidity
0   Lahore    35        60
1  Karachi    40        70
2   Multan    39        59

In [15]:
res_df.loc['USA']

       city  temp  humidity
0  New York    25        80
1        LA    16        65
2   Chicago    50        60

**Now if you have 2 df and you want them to append horizontaly than ,**

In [16]:
Pak_weather_t={
    "city":["Lahore","Karachi","Multan"],
    "temp":[35,40,39],
  
}
df3=pd.DataFrame(Pak_weather_t)
df3

      city  temp
0   Lahore    35
1  Karachi    40
2   Multan    39

In [17]:
Pak_weather_w={
    "city":["Lahore","Karachi","Multan"],
    "wind_speed":[5,10,7],
  
}
df4=pd.DataFrame(Pak_weather_w)
df4

      city  wind_speed
0   Lahore           5
1  Karachi          10
2   Multan           7

In [18]:
new_df=pd.concat([df3,df4])
new_df

      city  temp  wind_speed
0   Lahore  35.0         NaN
1  Karachi  40.0         NaN
2   Multan  39.0         NaN
0   Lahore   NaN         5.0
1  Karachi   NaN        10.0
2   Multan   NaN         7.0

In [19]:
new_df=pd.concat([df3,df4],axis=1)
new_df

      city  temp     city  wind_speed
0   Lahore    35   Lahore           5
1  Karachi    40  Karachi          10
2   Multan    39   Multan           7

In [23]:
Pak_weather_t={
    "city":["Lahore","Karachi","Multan"],
    "temp":[35,40,39],
  
}
df3=pd.DataFrame(Pak_weather_t)


Pak_weather_w={
    "city":["Karachi","Lahore"],
    "wind_speed":[10,7],
  
}
df4=pd.DataFrame(Pak_weather_w)

In [24]:
df3

      city  temp
0   Lahore    35
1  Karachi    40
2   Multan    39

In [25]:
df4

      city  wind_speed
0  Karachi          10
1   Lahore           7

In [26]:
new_df=pd.concat([df3,df4],axis=1)
new_df

      city  temp     city  wind_speed
0   Lahore    35  Karachi        10.0
1  Karachi    40   Lahore         7.0
2   Multan    39      NaN         NaN

**Now thats not right , there is the karachi next to Lahore inthe same row ... We can always provide the index when creating a df ...**

In [28]:
Pak_weather_t={
    "city":["Lahore","Karachi","Multan"],
    "temp":[35,40,39],
  
}
df3=pd.DataFrame(Pak_weather_t,index=[0,1,2])


Pak_weather_w={
    "city":["Karachi","Lahore"],
    "wind_speed":[10,7],
  
}
df4=pd.DataFrame(Pak_weather_w,index=[1,0])

In [29]:
df3

      city  temp
0   Lahore    35
1  Karachi    40
2   Multan    39

In [30]:
df4

      city  wind_speed
1  Karachi          10
0   Lahore           7

In [31]:
new_df=pd.concat([df3,df4],axis=1)
new_df

      city  temp     city  wind_speed
0   Lahore    35   Lahore         7.0
1  Karachi    40  Karachi        10.0
2   Multan    39      NaN         NaN

**So now its right ... there should a way so that it should automatically judge the index lahore and shows lahore infront of it ... And thats by using the PANDAS Merge function  ...**

# Concating DF and Series

In [33]:
Pak_weather_t={
    "city":["Lahore","Karachi","Multan"],
    "temp":[35,40,39],
  
}
df5=pd.DataFrame(Pak_weather_t)

In [34]:
s=pd.Series(["Rainy","Dry","Hot"],name="Event")
s

0    Rainy
1      Dry
2      Hot
Name: Event, dtype: object

In [35]:
df_s=pd.concat([df5,s])
df_s

      city  temp      0
0   Lahore  35.0    NaN
1  Karachi  40.0    NaN
2   Multan  39.0    NaN
0      NaN   NaN  Rainy
1      NaN   NaN    Dry
2      NaN   NaN    Hot

In [36]:
df_s=pd.concat([df5,s],axis=1)
df_s

      city  temp  Event
0   Lahore    35  Rainy
1  Karachi    40    Dry
2   Multan    39    Hot

**Thats looking good now**